{
  "job_boards": [
    {
      "name": "Wellfound (formerlly AngelList)",
      "outline": "A job board focusing on start ups looking to hire talent with a focus on technical talent",
      "link": "https://wellfound.com",
      "description": "Previously known as AngelList Jobs, Wellfound is the premiere site for working with start ups in various stages of funding and growth. Several famous companies advertised their positions here in their infancy such like Uber",
      "owner": "AngelList",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Thu, 08 Aug 2024 14:54:38 GMT"
    },
    {
      "name": "Work at a Start Up",
      "outline": "Y Combinator's job board for current YC companies looking for talent",
      "link": "https://workatastartup.com",
      "description": "A job board focused solely on companies that have been funded by Y Combinator, allowing users to create a profile based off their experience and reach out directly to the contact for the YC company. This job board isn't associated with the monthly Hacker News job posts.",
      "owner": "Y Combinator",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Thu, 08 Aug 2024 14:54:38 GMT"
    },
    {
      "name": "HNHiring",
      "outline": "An app that aggregates jobs from monthly Hacker News job threads",
      "link": "https://hnhiring.com/",
      "description": "An app independent of Hacker News that collects and sorts jobs from the monthly Hacker News 'Who is Hiring' threads made by date posted and specific keywords found in the job posts.",
      "owner": "Jordi Noguera",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Thu, 08 Aug 2024 14:54:38 GMT"
    },
    {
      "name": "Platform Engineering Jobs",
      "outline": "A job board managed by the Platform Engineering organization",
      "link": "https://platformengineering.org/jobs",
      "description": "A job board managed by the Platform Engineering organization focusing on advertising Platform Engineering specific jobs from some of the biggest tech organizations",
      "owner": "Platform Engineering",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Thu, 08 Aug 2024 14:54:38 GMT"
    },
    {
      "name": "levels.fyi Jobs",
      "outline": "levels.fyi's job board",
      "link": "https://www.levels.fyi/jobs",
      "description": "A job board managed by levels.fyi, focusing on software engineering, data science and product management roles, offering transparency on salary ranges for the roles advertised",
      "owner": "Platform Engineering",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Thu, 08 Aug 2024 14:54:38 GMT"
    }
  ],
  "books": [
    {
      "name": "The Tech Resume Inside Out",
      "outline": "A book detailing how to write resumes for technical professionals",
      "link": "https://thetechresume.com",
      "description": "The Tech Resume Inside Out is a book by Gergely Orosz which talks about the hiring process for tech companies, how to write a strong Engineering Resume and tips how to succeed at interviewing at tech companies.",
      "owner": "Gergerly Orosz",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Mon, 29 Jul 2024 14:47:40 GMT"
    },
    {
      "name": "System Design Interview - An Insider's guide",
      "outline": "Book series that teaches how to successfully pass a System Design Interview",
      "link": "https://bytebytego.com/",
      "description": "The System Design series is a series of books authored primarily by Alex Xu focusing on preparing readers for the System Design interview by taking readers through popular problems, how to think about their design and then designing them in an interview setting",
      "owner": "Alex Xu",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Mon, 29 Jul 2024 14:47:40 GMT"
    },
    {
      "name": "Cracking the Coding Interview",
      "outline": "The book for learning how to pass the interview process at Big Tech Companies",
      "link": "https://www.crackingthecodinginterview.com/",
      "description": "Cracking the Coding Interview is the defacto standard for practicing for coding interviews, starting with teaching the key Data Structures & Algorithms you'll need to be successful in the interview process but also give you practice problems to leverage the skills",
      "owner": "Alex Xu",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Mon, 29 Jul 2024 14:47:40 GMT"
    },
    {
      "name": "Tech Interview Handbook",
      "outline": "A continuously updated open source book on passing technical interviews",
      "link": "https://www.techinterviewhandbook.org/",
      "description": "The Tech Interview Handbook is an open source book for practicing for tech interviews, including advice on how to prepare for interview, questions and links to other resources to prepare for more role-specific interviews",
      "owner": "Yangshun Tay",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Mon, 29 Jul 2024 14:47:40 GMT"
    },
    {
      "name": "Resume Writing Guide",
      "outline": "A free resume writing guide focused on getting helping bootcamp grads get their first job",
      "link": "https://chaiwithjai.gumroad.com",
      "description": "Guide for coding bootcamp graduates.",
      "owner": "@ChaiWithJai",
      "submitted_by": "Jai Bhagat",
      "submitted_on": "Wed, 31 Jul 2024 14:39:46 GMT"
    }
  ],
  "communities": [
    {
      "name": "Virtual Coffee IO",
      "outline": "Community run by Bekah Weigel that holds virtual coffee sessions every Tuesday & Thursday",
      "link": "https://virtualcoffee.io/",
      "description": "Virtual Coffee is an online community run by Bekah Weigel known for holding virtual coffees twice every week, has extremely supportive members and events to help community members with their job search",
      "owner": "Bekah Weigel",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Mon, 29 Jul 2024 14:47:40 GMT"
    },
    {
      "name": "System Design Fight Club",
      "outline": "Community of Engineers helping each other to learn System Design, primarily to pass System Design Interviews",
      "link": "https://systemdesignfightclub.com/",
      "description": "System Design Fight Club is a community that started as a YouTube channel to help people learn how to ace system design interviews and now is a a community on Discord",
      "owner": "YubiDesu",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Mon, 29 Jul 2024 14:47:40 GMT"
    },
    {
      "name": "Taro",
      "outline": "A paid community that helps Software Engineers grow in their career",
      "link": "https://www.jointaro.com/",
      "description": "A paid community that focuses on growing Software Engineers by providing them with information and support to grown in their careers, including navigating the job search process",
      "owner": "Rahul Pandey, Alex Chiou",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Fri, 02 Aug 2024 16:17:43 GMT"
    },
    {
      "name": "100Devs",
      "outline": "Community-taught coding agency with a training program",
      "link": "https://100devs.org/about",
      "description": "More than just a job search resource, 100Devs is a community for learning how to code, how to network, practice interviewing, improve your resume/linkedin/etc., and how to freelance. The community is global, boasting a Discord server with over 60,000 people. Everyone there is kind, helpful, and supportive.",
      "owner": "Leon Noel",
      "submitted_by": "Danielle Andrews",
      "submitted_on": "Mon, 05 Aug 2024 18:03:50 GMT"
    }
  ],
  "websites": [
    {
      "name": "Levels.fyi",
      "outline": "Web app that shows the payscale for common roles at large tech companies",
      "link": "https://levels.fyi/",
      "description": "A web app who primarily brings visibility to tech job levels and the payscale that comes with each role",
      "owner": "Zaheer Mohiuddin, Zuhayeer Musa",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Mon, 29 Jul 2024 14:47:40 GMT"
    },
    {
      "name": "Interviewing.io",
      "outline": "Do mock interviews with Software Engineers from Big Tech orgs",
      "link": "https://interviewing.io/",
      "description": "A platform that allows interviewees to do mock interviews with Engineers working at Big Tech organizations, simulating interviews such as data structures and algorithms and system design interviews.",
      "owner": "Aline Lerner",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Mon, 29 Jul 2024 14:47:40 GMT"
    },
    {
      "name": "Pramp",
      "outline": "Pair with other job seekers, mock interviewing each other to practice technical and behavioral interviews",
      "link": "https://pramp.com/",
      "description": "A mock interview platform where two candidates agree to meet each other at a specific date and time, then mock interviews each other and provides feedback based on the interview,",
      "owner": "Rafi Zikavashvili",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Mon, 29 Jul 2024 14:47:40 GMT"
    }
  ],
  "people": [
    {
      "name": "Danny Thompson",
      "outline": "Current Director of Technology at ThisDotLabs, well known for teaching people, especially juniors how to break into tech",
      "link": "https://x.com/DThompsonDev",
      "description": "Danny Thompson has been helping new Software Engineers break into tech for several years now by sharing his own inspiring story as well as consistently giving practical tips to getting hired, Danny is someone to follow for tips to improve your job hunt",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Mon, 29 Jul 2024 14:47:40 GMT"
    },
    {
      "name": "Taylor Desseyn",
      "outline": "A Technical Recruiter known for creating content around getting the next tech job",
      "link": "https://www.linkedin.com/in/taylordesseyn/",
      "description": "Taylor Desseyn is a recruiter who has consistently helped job searchers in the tech industry find their next role through this content such as his LinkedIn videos where he brings someone on to talk about hiring and the job market",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Mon, 29 Jul 2024 14:47:40 GMT"
    },
    {
      "name": "Anthony D. Mays",
      "outline": "Former Senior Software Engineer at Google, now focuses on others, especially underrepresented persons break into Tech",
      "link": "https://x.com/anthonydmays",
      "description": "Anthony D. Mays, who was previously a Software Engineer at Google, now helps people find new opportunities in the tech industry, especially those from underrepresented groups through his work with Brilliant Black Minds and his own organization Morgan Latimer Consulting",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Mon, 29 Jul 2024 14:47:40 GMT"
    }
  ],
  "repos": [
    {
      "name": "The Algorithms",
      "outline": "Massive open source repo of completed solutions of various Data Structures & Algorithms in various programming languages",
      "link": "https://github.com/TheAlgorithms",
      "description": "The Algorithms is a GitHub repo that is a collection of Data Structures & Algorithms written in several programming languages from popular languages to more obscure ones as well as more common data structures to the more obscure and difficult to write",
      "owner": "Yangshun Tay",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Mon, 29 Jul 2024 14:47:40 GMT"
    },
    {
      "name": "System Design Primer",
      "outline": "Open source resource for learning the basics of System Design, specifically to pass System Design Interviews",
      "link": "https://github.com/donnemartin/system-design-primer",
      "description": "System Design Primer is a repo that focuses on learning the tools needed to ace system design interviews, teaching you the tools and technologies to build large-scale systems",
      "owner": "Donne Martin",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Mon, 29 Jul 2024 14:47:40 GMT"
    },
    {
      "name": "Coding Interview University",
      "outline": "An open source study plan that John Washam made to study for FAANG interviews",
      "link": "https://github.com/jwasham/coding-interview-university",
      "description": "An open source repo that serves as a multiple month study guide to pass Data Structures & Algorithm interviews commonly given by Big Tech / FAANG organizations!",
      "owner": "John Washam",
      "submitted_by": "Chad Stewart",
      "submitted_on": "Sun, 11 Aug 2024 19:49:24 GMT"
    }
  ]
}